# Задача-1: поработайте с переменными, создайте несколько, выведите на экран.
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

a = int(input("Please enter any number"))
b = input("what is you name")
c = float(input("please enter any float"))
print(a, b, c)
