# Запросите у пользователя значения выручки и издержек фирмы.
# Определите, с каким финансовым результатом работает фирма.
# (прибыль — выручка больше издержек, или убыток — издержки больше выручки). Выведите соответствующее сообщение
# Если фирма отработала с прибылью, вычислите рентабельность выручки (соотношение прибыли к выручке).
# Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.

profit = int(input("планируемая выручка: "))
costs = int(input("планируемые издержки: "))
if profit > costs:
    print(f"Рентабельность {profit / costs:.2f}")
    hr = int(input("кол-во сотрудников в штате: "))
    print(f"прибыль в расчете на одного сторудника сотавила: {profit / hr:.2f}")
elif profit == costs:
    print("Фирма работает в ноль")
else:
    print("Фирма работает в убыток")
